archive/before-2018-11-10/2017-06-26-openstack物理机异常掉电后，某些vm起不来的问题.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>记录一个难搞的openstack异常问题</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">记录一个难搞的openstack异常问题</h1>
<p>
<code>openstack</code> 物理机异常掉电后，某些vm起不来的问题一直停在：
</p>
<pre class="example">
  parser"
   * Starting configure network device security                            [ OK ]
   * Starting configure network device security                            [ OK ]
   * Starting Mount network filesystems                                    [ OK ]
   * Stopping Mount network filesystems                                    [ OK ]
   * Starting Bridge socket events into upstart                            [ OK ]
   * Starting Mount network filesystems                                    [ OK ]
   * Starting configure network device                                     [ OK ]
   * Stopping Mount network filesystems                                    [ OK ]
   * Starting configure network device                                     [ OK ]
   * Stopping cold plug devices                                            [ OK ]
   * Stopping log initial device creation                                  [ OK ]
   * Starting enable remaining boot-time encrypted block devices           [ OK ]
</pre>

<p>
我在 <a href="https://bugs.launchpad.net/linuxmint/+bug/1339249">这里</a> 搜到这样一个解法：
</p>
<pre class="example">
  I occasionally have this identical issue with Ubuntu when running it
  as a VirtualBox appliance. It happens when there is an fstab entry to
  mount a device on boot, but the device doesn't exist. I suppose there
  could be other possible issues, perhaps where the device name has
  changed for some reason, but essentially that is just as bad since
  mount is very picky.

  In my case it happens when I have manually created an fstab entry to
  mount a shared folder (vboxfs), which has been removed from the
  virtual machine's settings or source folder deleted from the host
  machine.

  To fix you must drop into recovery mode on boot, remount the root
  partition as read/write if necessary, edit fstab to fix or comment out
  the offending entry, save it and reboot.

  I hope this helps you solve your problem guys, good luck!
</pre>

<p>
实际处理后，问题应该就和他说的差不多，原因其实很简单：因为起不来的虚
拟机都是外挂了磁盘的。异常掉电后导致磁盘的状态有些不正常。而我们在
<code>fstab</code> 中加入了启动挂载。于是操作系统在启动的时候一直尝试去挂载一块
不正常的磁盘。就卡住啦。
</p>

<p>
如果是物理机发生这种情况，可以尝试这样修复一下：
</p>
<ol class="org-ol">
<li>使用LiveCD登进去修改一下 <code>fstab</code> ，把自动挂载去掉。重启。</li>
<li>使用 <code>fsck /dev/sdX</code> 来尝试修复下对应的硬盘。</li>
<li>再修改 <code>fstab</code> ，设置好自动挂载。重启机器。</li>
</ol>

<p>
但是我们是在云上，而且外挂磁盘还做成了lvm。不过做法也差不多：
</p>
<ol class="org-ol">
<li><p>
使用 <code>openstack</code> 的 <code>cli</code> 把磁盘 <code>umount</code> 掉。
</p>
<div class="org-src-container">
<pre class="src src-sh">     openstack server remove volume &lt;server&gt; &lt;volume&gt;
</pre>
</div></li>
<li>重启机器应该就可以进去了。</li>
<li>修改一下 <code>fstab</code> ，把自动挂载去掉。重启。</li>
<li><p>
lvm不能直接使用 <code>fsck /dev/sdX</code> 来修复对应的“物理盘”。需要修复
“逻辑盘”。也就是对应的lvm的vg。可以使用 <code>vgs</code> 查一下啦。最后修复
lvm我测试使用 <code>fsck</code> 还没用。需要使用 <code>e2fsck</code> 。
</p>
<div class="org-src-container">
<pre class="src src-sh">        e2fsck /dev/compute-vg/root
</pre>
</div>
<p>
然后一路yes。
</p></li>
<li>再修改 <code>fstab</code> ，设置好自动挂载。重启机器。</li>
</ol>

<p>
终于把这个烦人的问题搞定了！
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>